is1200-example-projects/mcb32tools/headers/proc/p32mz2048ecg064.h
extern volatile __AD1DSTAT2bits_t AD1DSTAT2bits __asm__ ("AD1DSTAT2") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMPEN1 __attribute__((section("sfrs")));
typedef struct {
  unsigned CMPE0:1;
  unsigned CMPE1:1;
  unsigned CMPE2:1;
  unsigned CMPE3:1;
  unsigned CMPE4:1;
  unsigned CMPE5:1;
  unsigned CMPE6:1;
  unsigned CMPE7:1;
  unsigned CMPE8:1;
  unsigned CMPE9:1;
  unsigned CMPE10:1;
  unsigned CMPE11:1;
  unsigned CMPE12:1;
  unsigned CMPE13:1;
  unsigned CMPE14:1;
  unsigned CMPE15:1;
  unsigned CMPE16:1;
  unsigned CMPE17:1;
  unsigned CMPE18:1;
} __AD1CMPEN1bits_t;
extern volatile __AD1CMPEN1bits_t AD1CMPEN1bits __asm__ ("AD1CMPEN1") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMP1 __attribute__((section("sfrs")));
typedef struct {
  unsigned ADCMPLO:16;
  unsigned ADCMPHI:16;
} __AD1CMP1bits_t;
extern volatile __AD1CMP1bits_t AD1CMP1bits __asm__ ("AD1CMP1") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMPEN2 __attribute__((section("sfrs")));
typedef struct {
  unsigned CMPE0:1;
  unsigned CMPE1:1;
  unsigned CMPE2:1;
  unsigned CMPE3:1;
  unsigned CMPE4:1;
  unsigned CMPE5:1;
  unsigned CMPE6:1;
  unsigned CMPE7:1;
  unsigned CMPE8:1;
  unsigned CMPE9:1;
  unsigned CMPE10:1;
  unsigned CMPE11:1;
  unsigned CMPE12:1;
  unsigned CMPE13:1;
  unsigned CMPE14:1;
  unsigned CMPE15:1;
  unsigned CMPE16:1;
  unsigned CMPE17:1;
  unsigned CMPE18:1;
} __AD1CMPEN2bits_t;
extern volatile __AD1CMPEN2bits_t AD1CMPEN2bits __asm__ ("AD1CMPEN2") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMP2 __attribute__((section("sfrs")));
typedef struct {
  unsigned ADCMPLO:16;
  unsigned ADCMPHI:16;
} __AD1CMP2bits_t;
extern volatile __AD1CMP2bits_t AD1CMP2bits __asm__ ("AD1CMP2") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMPEN3 __attribute__((section("sfrs")));
typedef struct {
  unsigned CMPE0:1;
  unsigned CMPE1:1;
  unsigned CMPE2:1;
  unsigned CMPE3:1;
  unsigned CMPE4:1;
  unsigned CMPE5:1;
  unsigned CMPE6:1;
  unsigned CMPE7:1;
  unsigned CMPE8:1;
  unsigned CMPE9:1;
  unsigned CMPE10:1;
  unsigned CMPE11:1;
  unsigned CMPE12:1;
  unsigned CMPE13:1;
  unsigned CMPE14:1;
  unsigned CMPE15:1;
  unsigned CMPE16:1;
  unsigned CMPE17:1;
  unsigned CMPE18:1;
} __AD1CMPEN3bits_t;
extern volatile __AD1CMPEN3bits_t AD1CMPEN3bits __asm__ ("AD1CMPEN3") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMP3 __attribute__((section("sfrs")));
typedef struct {
  unsigned ADCMPLO:16;
  unsigned ADCMPHI:16;
} __AD1CMP3bits_t;
extern volatile __AD1CMP3bits_t AD1CMP3bits __asm__ ("AD1CMP3") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMPEN4 __attribute__((section("sfrs")));
typedef struct {
  unsigned CMPE0:1;
  unsigned CMPE1:1;
  unsigned CMPE2:1;
  unsigned CMPE3:1;
  unsigned CMPE4:1;
  unsigned CMPE5:1;
  unsigned CMPE6:1;
  unsigned CMPE7:1;
  unsigned CMPE8:1;
  unsigned CMPE9:1;
  unsigned CMPE10:1;
  unsigned CMPE11:1;
  unsigned CMPE12:1;
  unsigned CMPE13:1;
  unsigned CMPE14:1;
  unsigned CMPE15:1;
  unsigned CMPE16:1;
  unsigned CMPE17:1;
  unsigned CMPE18:1;
} __AD1CMPEN4bits_t;
extern volatile __AD1CMPEN4bits_t AD1CMPEN4bits __asm__ ("AD1CMPEN4") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMP4 __attribute__((section("sfrs")));
typedef struct {
  unsigned ADCMPLO:16;
  unsigned ADCMPHI:16;
} __AD1CMP4bits_t;
extern volatile __AD1CMP4bits_t AD1CMP4bits __asm__ ("AD1CMP4") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMPEN5 __attribute__((section("sfrs")));
typedef struct {
  unsigned CMPE0:1;
  unsigned CMPE1:1;
  unsigned CMPE2:1;
  unsigned CMPE3:1;
  unsigned CMPE4:1;
  unsigned CMPE5:1;
  unsigned CMPE6:1;
  unsigned CMPE7:1;
  unsigned CMPE8:1;
  unsigned CMPE9:1;
  unsigned CMPE10:1;
  unsigned CMPE11:1;
  unsigned CMPE12:1;
  unsigned CMPE13:1;
  unsigned CMPE14:1;
  unsigned CMPE15:1;
  unsigned CMPE16:1;
  unsigned CMPE17:1;
  unsigned CMPE18:1;
} __AD1CMPEN5bits_t;
extern volatile __AD1CMPEN5bits_t AD1CMPEN5bits __asm__ ("AD1CMPEN5") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMP5 __attribute__((section("sfrs")));
typedef struct {
  unsigned ADCMPLO:16;
  unsigned ADCMPHI:16;
} __AD1CMP5bits_t;
extern volatile __AD1CMP5bits_t AD1CMP5bits __asm__ ("AD1CMP5") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMPEN6 __attribute__((section("sfrs")));
typedef struct {
  unsigned CMPE0:1;
  unsigned CMPE1:1;
  unsigned CMPE2:1;
  unsigned CMPE3:1;
  unsigned CMPE4:1;
  unsigned CMPE5:1;
  unsigned CMPE6:1;
  unsigned CMPE7:1;
  unsigned CMPE8:1;
  unsigned CMPE9:1;
  unsigned CMPE10:1;
  unsigned CMPE11:1;
  unsigned CMPE12:1;
  unsigned CMPE13:1;
  unsigned CMPE14:1;
  unsigned CMPE15:1;
  unsigned CMPE16:1;
  unsigned CMPE17:1;
  unsigned CMPE18:1;
} __AD1CMPEN6bits_t;
extern volatile __AD1CMPEN6bits_t AD1CMPEN6bits __asm__ ("AD1CMPEN6") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMP6 __attribute__((section("sfrs")));
typedef struct {
  unsigned ADCMPLO:16;
  unsigned ADCMPHI:16;
} __AD1CMP6bits_t;
extern volatile __AD1CMP6bits_t AD1CMP6bits __asm__ ("AD1CMP6") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1FLTR1 __attribute__((section("sfrs")));
typedef struct {
  unsigned FLTRDATA:16;
  unsigned CHNLID:6;
  unsigned :2;
  unsigned AFRDY:1;
  unsigned AFGIEN:1;
  unsigned OVRSAM:3;
  unsigned :2;
  unsigned AFEN:1;
} __AD1FLTR1bits_t;
extern volatile __AD1FLTR1bits_t AD1FLTR1bits __asm__ ("AD1FLTR1") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1FLTR2 __attribute__((section("sfrs")));
typedef struct {
  unsigned FLTRDATA:16;
  unsigned CHNLID:6;
  unsigned :2;
  unsigned AFRDY:1;
  unsigned AFGIEN:1;
  unsigned OVRSAM:3;
  unsigned :2;
  unsigned AFEN:1;
} __AD1FLTR2bits_t;
extern volatile __AD1FLTR2bits_t AD1FLTR2bits __asm__ ("AD1FLTR2") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1FLTR3 __attribute__((section("sfrs")));
typedef struct {
  unsigned FLTRDATA:16;
  unsigned CHNLID:6;
  unsigned :2;
  unsigned AFRDY:1;
  unsigned AFGIEN:1;
  unsigned OVRSAM:3;
  unsigned :2;
  unsigned AFEN:1;
} __AD1FLTR3bits_t;
