is1200-example-projects/mcb32tools/headers/proc/p32mz2048ecg064.h
extern volatile __DEVCFG1bits_t DEVCFG1bits __asm__ ("DEVCFG1") __attribute__((section("sfrs")));
extern volatile unsigned int        DEVCFG0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned :15;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG0bits_t;
extern volatile __DEVCFG0bits_t DEVCFG0bits __asm__ ("DEVCFG0") __attribute__((section("sfrs")));
extern volatile unsigned int        DEVCP3 __attribute__((section("sfrs")));
extern volatile unsigned int        DEVCP2 __attribute__((section("sfrs")));
extern volatile unsigned int        DEVCP1 __attribute__((section("sfrs")));
extern volatile unsigned int        DEVCP0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __DEVCP0bits_t;
extern volatile __DEVCP0bits_t DEVCP0bits __asm__ ("DEVCP0") __attribute__((section("sfrs")));
extern volatile unsigned int        DEVSIGN3 __attribute__((section("sfrs")));
extern volatile unsigned int        DEVSIGN2 __attribute__((section("sfrs")));
extern volatile unsigned int        DEVSIGN1 __attribute__((section("sfrs")));
extern volatile unsigned int        DEVSIGN0 __attribute__((section("sfrs")));
extern volatile unsigned int        SEQ3 __attribute__((section("sfrs")));
extern volatile unsigned int        SEQ2 __attribute__((section("sfrs")));
extern volatile unsigned int        SEQ1 __attribute__((section("sfrs")));
extern volatile unsigned int        SEQ0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __SEQ0bits_t;
extern volatile __SEQ0bits_t SEQ0bits __asm__ ("SEQ0") __attribute__((section("sfrs")));
extern volatile unsigned int        DEVADC1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCCALDATA:32;
  };
  struct {
    unsigned w:32;
  };
} __DEVADC1bits_t;
extern volatile __DEVADC1bits_t DEVADC1bits __asm__ ("DEVADC1") __attribute__((section("sfrs")));
extern volatile unsigned int        DEVADC2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCCALDATA:32;
  };
  struct {
    unsigned w:32;
  };
} __DEVADC2bits_t;
extern volatile __DEVADC2bits_t DEVADC2bits __asm__ ("DEVADC2") __attribute__((section("sfrs")));
extern volatile unsigned int        DEVADC3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCCALDATA:32;
  };
  struct {
    unsigned w:32;
  };
} __DEVADC3bits_t;
extern volatile __DEVADC3bits_t DEVADC3bits __asm__ ("DEVADC3") __attribute__((section("sfrs")));
extern volatile unsigned int        DEVADC4 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCCALDATA:32;
  };
  struct {
    unsigned w:32;
  };
} __DEVADC4bits_t;
extern volatile __DEVADC4bits_t DEVADC4bits __asm__ ("DEVADC4") __attribute__((section("sfrs")));
extern volatile unsigned int        DEVADC5 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ADCCALDATA:32;
  };
  struct {
    unsigned w:32;
  };
} __DEVADC5bits_t;
extern volatile __DEVADC5bits_t DEVADC5bits __asm__ ("DEVADC5") __attribute__((section("sfrs")));
extern volatile unsigned int        DEVSN0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned SN:32;
  };
  struct {
    unsigned w:32;
  };
} __DEVSN0bits_t;
extern volatile __DEVSN0bits_t DEVSN0bits __asm__ ("DEVSN0") __attribute__((section("sfrs")));
extern volatile unsigned int        DEVSN1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned SN:32;
  };
  struct {
    unsigned w:32;
  };
} __DEVSN1bits_t;
extern volatile __DEVSN1bits_t DEVSN1bits __asm__ ("DEVSN1") __attribute__((section("sfrs")));
extern volatile unsigned int        ADEVCFG3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCFG3bits_t;
extern volatile __ADEVCFG3bits_t ADEVCFG3bits __asm__ ("ADEVCFG3") __attribute__((section("sfrs")));
extern volatile unsigned int        ADEVCFG2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
    unsigned UPLLEN:1;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCFG2bits_t;
extern volatile __ADEVCFG2bits_t ADEVCFG2bits __asm__ ("ADEVCFG2") __attribute__((section("sfrs")));
extern volatile unsigned int        ADEVCFG1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCFG1bits_t;
extern volatile __ADEVCFG1bits_t ADEVCFG1bits __asm__ ("ADEVCFG1") __attribute__((section("sfrs")));
extern volatile unsigned int        ADEVCFG0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned :15;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCFG0bits_t;
extern volatile __ADEVCFG0bits_t ADEVCFG0bits __asm__ ("ADEVCFG0") __attribute__((section("sfrs")));
extern volatile unsigned int        ADEVCP3 __attribute__((section("sfrs")));
extern volatile unsigned int        ADEVCP2 __attribute__((section("sfrs")));
extern volatile unsigned int        ADEVCP1 __attribute__((section("sfrs")));
extern volatile unsigned int        ADEVCP0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCP0bits_t;
extern volatile __ADEVCP0bits_t ADEVCP0bits __asm__ ("ADEVCP0") __attribute__((section("sfrs")));
extern volatile unsigned int        ADEVSIGN3 __attribute__((section("sfrs")));
extern volatile unsigned int        ADEVSIGN2 __attribute__((section("sfrs")));
extern volatile unsigned int        ADEVSIGN1 __attribute__((section("sfrs")));
extern volatile unsigned int        ADEVSIGN0 __attribute__((section("sfrs")));
extern volatile unsigned int        ASEQ3 __attribute__((section("sfrs")));
extern volatile unsigned int        ASEQ2 __attribute__((section("sfrs")));
extern volatile unsigned int        ASEQ1 __attribute__((section("sfrs")));
extern volatile unsigned int        ASEQ0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __ASEQ0bits_t;
extern volatile __ASEQ0bits_t ASEQ0bits __asm__ ("ASEQ0") __attribute__((section("sfrs")));
extern volatile unsigned int        ABF1DEVCFG3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF1DEVCFG3bits_t;
