is1200-example-projects/mcb32tools/headers/proc/p32mz2048ecg064.h
#define _USBE5RXA_RXHUBPRT_POSITION              0x00000018
#define _USBE5RXA_RXHUBPRT_MASK                  0x7F000000
#define _USBE5RXA_RXHUBPRT_LENGTH                0x00000007

#define _USBE6TXA_TXFADDR_POSITION               0x00000000
#define _USBE6TXA_TXFADDR_MASK                   0x0000007F
#define _USBE6TXA_TXFADDR_LENGTH                 0x00000007

#define _USBE6TXA_TXHUBADD_POSITION              0x00000010
#define _USBE6TXA_TXHUBADD_MASK                  0x007F0000
#define _USBE6TXA_TXHUBADD_LENGTH                0x00000007

#define _USBE6TXA_MULTTRAN_POSITION              0x00000017
#define _USBE6TXA_MULTTRAN_MASK                  0x00800000
#define _USBE6TXA_MULTTRAN_LENGTH                0x00000001

#define _USBE6TXA_TXHUBPRT_POSITION              0x00000018
#define _USBE6TXA_TXHUBPRT_MASK                  0x7F000000
#define _USBE6TXA_TXHUBPRT_LENGTH                0x00000007

#define _USBE6RXA_RXFADDR_POSITION               0x00000000
#define _USBE6RXA_RXFADDR_MASK                   0x0000007F
#define _USBE6RXA_RXFADDR_LENGTH                 0x00000007

#define _USBE6RXA_RXHUBADD_POSITION              0x00000010
#define _USBE6RXA_RXHUBADD_MASK                  0x007F0000
#define _USBE6RXA_RXHUBADD_LENGTH                0x00000007

#define _USBE6RXA_MULTTRAN_POSITION              0x00000017
#define _USBE6RXA_MULTTRAN_MASK                  0x00800000
#define _USBE6RXA_MULTTRAN_LENGTH                0x00000001

#define _USBE6RXA_RXHUBPRT_POSITION              0x00000018
#define _USBE6RXA_RXHUBPRT_MASK                  0x7F000000
#define _USBE6RXA_RXHUBPRT_LENGTH                0x00000007

#define _USBE7TXA_TXFADDR_POSITION               0x00000000
#define _USBE7TXA_TXFADDR_MASK                   0x0000007F
#define _USBE7TXA_TXFADDR_LENGTH                 0x00000007

#define _USBE7TXA_TXHUBADD_POSITION              0x00000010
#define _USBE7TXA_TXHUBADD_MASK                  0x007F0000
#define _USBE7TXA_TXHUBADD_LENGTH                0x00000007

#define _USBE7TXA_MULTTRAN_POSITION              0x00000017
#define _USBE7TXA_MULTTRAN_MASK                  0x00800000
#define _USBE7TXA_MULTTRAN_LENGTH                0x00000001

#define _USBE7TXA_TXHUBPRT_POSITION              0x00000018
#define _USBE7TXA_TXHUBPRT_MASK                  0x7F000000
#define _USBE7TXA_TXHUBPRT_LENGTH                0x00000007

#define _USBE7RXA_RXFADDR_POSITION               0x00000000
#define _USBE7RXA_RXFADDR_MASK                   0x0000007F
#define _USBE7RXA_RXFADDR_LENGTH                 0x00000007

#define _USBE7RXA_RXHUBADD_POSITION              0x00000010
#define _USBE7RXA_RXHUBADD_MASK                  0x007F0000
#define _USBE7RXA_RXHUBADD_LENGTH                0x00000007

#define _USBE7RXA_MULTTRAN_POSITION              0x00000017
#define _USBE7RXA_MULTTRAN_MASK                  0x00800000
#define _USBE7RXA_MULTTRAN_LENGTH                0x00000001

#define _USBE7RXA_RXHUBPRT_POSITION              0x00000018
#define _USBE7RXA_RXHUBPRT_MASK                  0x7F000000
#define _USBE7RXA_RXHUBPRT_LENGTH                0x00000007

#define _USBE0CSR0_TXMAXP_POSITION               0x00000000
#define _USBE0CSR0_TXMAXP_MASK                   0x000007FF
#define _USBE0CSR0_TXMAXP_LENGTH                 0x0000000B

#define _USBE0CSR0_RXRDY_POSITION                0x00000010
#define _USBE0CSR0_RXRDY_MASK                    0x00010000
#define _USBE0CSR0_RXRDY_LENGTH                  0x00000001

#define _USBE0CSR0_TXRDY_POSITION                0x00000011
#define _USBE0CSR0_TXRDY_MASK                    0x00020000
#define _USBE0CSR0_TXRDY_LENGTH                  0x00000001

#define _USBE0CSR0_STALLED_POSITION              0x00000012
#define _USBE0CSR0_STALLED_MASK                  0x00040000
#define _USBE0CSR0_STALLED_LENGTH                0x00000001

#define _USBE0CSR0_SETUP_POSITION                0x00000013
#define _USBE0CSR0_SETUP_MASK                    0x00080000
#define _USBE0CSR0_SETUP_LENGTH                  0x00000001

#define _USBE0CSR0_ERROR_POSITION                0x00000014
#define _USBE0CSR0_ERROR_MASK                    0x00100000
#define _USBE0CSR0_ERROR_LENGTH                  0x00000001

#define _USBE0CSR0_REQPKT_POSITION               0x00000015
#define _USBE0CSR0_REQPKT_MASK                   0x00200000
#define _USBE0CSR0_REQPKT_LENGTH                 0x00000001

#define _USBE0CSR0_STATUS_POSITION               0x00000016
#define _USBE0CSR0_STATUS_MASK                   0x00400000
#define _USBE0CSR0_STATUS_LENGTH                 0x00000001

#define _USBE0CSR0_NAKTO_POSITION                0x00000017
#define _USBE0CSR0_NAKTO_MASK                    0x00800000
#define _USBE0CSR0_NAKTO_LENGTH                  0x00000001

#define _USBE0CSR0_FLUSH_POSITION                0x00000018
#define _USBE0CSR0_FLUSH_MASK                    0x01000000
#define _USBE0CSR0_FLUSH_LENGTH                  0x00000001

#define _USBE0CSR0_DT_POSITION                   0x00000019
#define _USBE0CSR0_DT_MASK                       0x02000000
#define _USBE0CSR0_DT_LENGTH                     0x00000001

#define _USBE0CSR0_DTWE_POSITION                 0x0000001A
#define _USBE0CSR0_DTWE_MASK                     0x04000000
#define _USBE0CSR0_DTWE_LENGTH                   0x00000001

#define _USBE0CSR0_DATAEND_POSITION              0x00000013
#define _USBE0CSR0_DATAEND_MASK                  0x00080000
#define _USBE0CSR0_DATAEND_LENGTH                0x00000001

#define _USBE0CSR0_SETEND_POSITION               0x00000014
#define _USBE0CSR0_SETEND_MASK                   0x00100000
#define _USBE0CSR0_SETEND_LENGTH                 0x00000001

#define _USBE0CSR0_STALL_POSITION                0x00000015
#define _USBE0CSR0_STALL_MASK                    0x00200000
#define _USBE0CSR0_STALL_LENGTH                  0x00000001

#define _USBE0CSR0_RXRDYC_POSITION               0x00000016
#define _USBE0CSR0_RXRDYC_MASK                   0x00400000
#define _USBE0CSR0_RXRDYC_LENGTH                 0x00000001

#define _USBE0CSR0_SETENDC_POSITION              0x00000017
#define _USBE0CSR0_SETENDC_MASK                  0x00800000
#define _USBE0CSR0_SETENDC_LENGTH                0x00000001

