is1200-example-projects/mcb32tools/headers/proc/p32mz2048ecg064.h
#define _USBE3CSR1_REQPKT_POSITION               0x00000015
#define _USBE3CSR1_REQPKT_MASK                   0x00200000
#define _USBE3CSR1_REQPKT_LENGTH                 0x00000001

#define _USBE3CSR1_RXSTALL_POSITION              0x00000016
#define _USBE3CSR1_RXSTALL_MASK                  0x00400000
#define _USBE3CSR1_RXSTALL_LENGTH                0x00000001

#define _USBE3CSR1_CLRDT_POSITION                0x00000017
#define _USBE3CSR1_CLRDT_MASK                    0x00800000
#define _USBE3CSR1_CLRDT_LENGTH                  0x00000001

#define _USBE3CSR1_INCOMPRX_POSITION             0x00000018
#define _USBE3CSR1_INCOMPRX_MASK                 0x01000000
#define _USBE3CSR1_INCOMPRX_LENGTH               0x00000001

#define _USBE3CSR1_DATATGGL_POSITION             0x00000019
#define _USBE3CSR1_DATATGGL_MASK                 0x02000000
#define _USBE3CSR1_DATATGGL_LENGTH               0x00000001

#define _USBE3CSR1_DATATWEN_POSITION             0x0000001A
#define _USBE3CSR1_DATATWEN_MASK                 0x04000000
#define _USBE3CSR1_DATATWEN_LENGTH               0x00000001

#define _USBE3CSR1_DMAREQMD_POSITION             0x0000001B
#define _USBE3CSR1_DMAREQMD_MASK                 0x08000000
#define _USBE3CSR1_DMAREQMD_LENGTH               0x00000001

#define _USBE3CSR1_PIDERR_POSITION               0x0000001C
#define _USBE3CSR1_PIDERR_MASK                   0x10000000
#define _USBE3CSR1_PIDERR_LENGTH                 0x00000001

#define _USBE3CSR1_DMAREQEN_POSITION             0x0000001D
#define _USBE3CSR1_DMAREQEN_MASK                 0x20000000
#define _USBE3CSR1_DMAREQEN_LENGTH               0x00000001

#define _USBE3CSR1_AUTORQ_POSITION               0x0000001E
#define _USBE3CSR1_AUTORQ_MASK                   0x40000000
#define _USBE3CSR1_AUTORQ_LENGTH                 0x00000001

#define _USBE3CSR1_AUTOCLR_POSITION              0x0000001F
#define _USBE3CSR1_AUTOCLR_MASK                  0x80000000
#define _USBE3CSR1_AUTOCLR_LENGTH                0x00000001

#define _USBE3CSR1_UNDERRUN_POSITION             0x00000012
#define _USBE3CSR1_UNDERRUN_MASK                 0x00040000
#define _USBE3CSR1_UNDERRUN_LENGTH               0x00000001

#define _USBE3CSR1_SENDSTALL_POSITION            0x00000014
#define _USBE3CSR1_SENDSTALL_MASK                0x00100000
#define _USBE3CSR1_SENDSTALL_LENGTH              0x00000001

#define _USBE3CSR1_SENTSTALL_POSITION            0x00000015
#define _USBE3CSR1_SENTSTALL_MASK                0x00200000
#define _USBE3CSR1_SENTSTALL_LENGTH              0x00000001

#define _USBE3CSR1_INCOMPTX_POSITION             0x00000017
#define _USBE3CSR1_INCOMPTX_MASK                 0x00800000
#define _USBE3CSR1_INCOMPTX_LENGTH               0x00000001

#define _USBE3CSR1_ISO_POSITION                  0x0000001E
#define _USBE3CSR1_ISO_MASK                      0x40000000
#define _USBE3CSR1_ISO_LENGTH                    0x00000001

#define _USBE3CSR2_RXCNT_POSITION                0x00000000
#define _USBE3CSR2_RXCNT_MASK                    0x00003FFF
#define _USBE3CSR2_RXCNT_LENGTH                  0x0000000E

#define _USBE3CSR2_TEP_POSITION                  0x00000010
#define _USBE3CSR2_TEP_MASK                      0x000F0000
#define _USBE3CSR2_TEP_LENGTH                    0x00000004

#define _USBE3CSR2_PROTOCOL_POSITION             0x00000014
#define _USBE3CSR2_PROTOCOL_MASK                 0x00300000
#define _USBE3CSR2_PROTOCOL_LENGTH               0x00000002

#define _USBE3CSR2_SPEED_POSITION                0x00000016
#define _USBE3CSR2_SPEED_MASK                    0x00C00000
#define _USBE3CSR2_SPEED_LENGTH                  0x00000002

#define _USBE3CSR2_TXINTERV_POSITION             0x00000018
#define _USBE3CSR2_TXINTERV_MASK                 0xFF000000
#define _USBE3CSR2_TXINTERV_LENGTH               0x00000008

#define _USBE3CSR3_TEP_POSITION                  0x00000000
#define _USBE3CSR3_TEP_MASK                      0x0000000F
#define _USBE3CSR3_TEP_LENGTH                    0x00000004

#define _USBE3CSR3_PROTOCOL_POSITION             0x00000004
#define _USBE3CSR3_PROTOCOL_MASK                 0x00000030
#define _USBE3CSR3_PROTOCOL_LENGTH               0x00000002

#define _USBE3CSR3_SPEED_POSITION                0x00000006
#define _USBE3CSR3_SPEED_MASK                    0x000000C0
#define _USBE3CSR3_SPEED_LENGTH                  0x00000002

#define _USBE3CSR3_RXINTERV_POSITION             0x00000008
#define _USBE3CSR3_RXINTERV_MASK                 0x0000FF00
#define _USBE3CSR3_RXINTERV_LENGTH               0x00000008

#define _USBE3CSR3_TXFIFOSZ_POSITION             0x00000018
#define _USBE3CSR3_TXFIFOSZ_MASK                 0x0F000000
#define _USBE3CSR3_TXFIFOSZ_LENGTH               0x00000004

#define _USBE3CSR3_RXFIFOSZ_POSITION             0x0000001C
#define _USBE3CSR3_RXFIFOSZ_MASK                 0xF0000000
#define _USBE3CSR3_RXFIFOSZ_LENGTH               0x00000004

#define _USBE4CSR0_TXMAXP_POSITION               0x00000000
#define _USBE4CSR0_TXMAXP_MASK                   0x000007FF
#define _USBE4CSR0_TXMAXP_LENGTH                 0x0000000B

#define _USBE4CSR0_MULT_POSITION                 0x0000000B
#define _USBE4CSR0_MULT_MASK                     0x0000F800
#define _USBE4CSR0_MULT_LENGTH                   0x00000005

#define _USBE4CSR0_TXPKTRDY_POSITION             0x00000010
#define _USBE4CSR0_TXPKTRDY_MASK                 0x00010000
#define _USBE4CSR0_TXPKTRDY_LENGTH               0x00000001

#define _USBE4CSR0_FIFONE_POSITION               0x00000011
#define _USBE4CSR0_FIFONE_MASK                   0x00020000
#define _USBE4CSR0_FIFONE_LENGTH                 0x00000001

#define _USBE4CSR0_ERROR_POSITION                0x00000012
#define _USBE4CSR0_ERROR_MASK                    0x00040000
#define _USBE4CSR0_ERROR_LENGTH                  0x00000001

#define _USBE4CSR0_FLUSH_POSITION                0x00000013
#define _USBE4CSR0_FLUSH_MASK                    0x00080000
#define _USBE4CSR0_FLUSH_LENGTH                  0x00000001

#define _USBE4CSR0_SETUPPKT_POSITION             0x00000014
#define _USBE4CSR0_SETUPPKT_MASK                 0x00100000
#define _USBE4CSR0_SETUPPKT_LENGTH               0x00000001

#define _USBE4CSR0_RXSTALL_POSITION              0x00000015
#define _USBE4CSR0_RXSTALL_MASK                  0x00200000
#define _USBE4CSR0_RXSTALL_LENGTH                0x00000001

