is1200-example-projects/mcb32tools/headers/proc/p32mz2048ecg064.h
#define _USBDMA1C_DMAERR_POSITION                0x00000008
#define _USBDMA1C_DMAERR_MASK                    0x00000100
#define _USBDMA1C_DMAERR_LENGTH                  0x00000001

#define _USBDMA1C_DMABRSTM_POSITION              0x00000009
#define _USBDMA1C_DMABRSTM_MASK                  0x00000600
#define _USBDMA1C_DMABRSTM_LENGTH                0x00000002

#define _USBDMA1A_DMAADDR_POSITION               0x00000000
#define _USBDMA1A_DMAADDR_MASK                   0xFFFFFFFF
#define _USBDMA1A_DMAADDR_LENGTH                 0x00000020

#define _USBDMA1N_DMACOUNT_POSITION              0x00000000
#define _USBDMA1N_DMACOUNT_MASK                  0xFFFFFFFF
#define _USBDMA1N_DMACOUNT_LENGTH                0x00000020

#define _USBDMA2C_DMAEN_POSITION                 0x00000000
#define _USBDMA2C_DMAEN_MASK                     0x00000001
#define _USBDMA2C_DMAEN_LENGTH                   0x00000001

#define _USBDMA2C_DMADIR_POSITION                0x00000001
#define _USBDMA2C_DMADIR_MASK                    0x00000002
#define _USBDMA2C_DMADIR_LENGTH                  0x00000001

#define _USBDMA2C_DMAMODE_POSITION               0x00000002
#define _USBDMA2C_DMAMODE_MASK                   0x00000004
#define _USBDMA2C_DMAMODE_LENGTH                 0x00000001

#define _USBDMA2C_DMAIE_POSITION                 0x00000003
#define _USBDMA2C_DMAIE_MASK                     0x00000008
#define _USBDMA2C_DMAIE_LENGTH                   0x00000001

#define _USBDMA2C_DMAEP_POSITION                 0x00000004
#define _USBDMA2C_DMAEP_MASK                     0x000000F0
#define _USBDMA2C_DMAEP_LENGTH                   0x00000004

#define _USBDMA2C_DMAERR_POSITION                0x00000008
#define _USBDMA2C_DMAERR_MASK                    0x00000100
#define _USBDMA2C_DMAERR_LENGTH                  0x00000001

#define _USBDMA2C_DMABRSTM_POSITION              0x00000009
#define _USBDMA2C_DMABRSTM_MASK                  0x00000600
#define _USBDMA2C_DMABRSTM_LENGTH                0x00000002

#define _USBDMA2A_DMAADDR_POSITION               0x00000000
#define _USBDMA2A_DMAADDR_MASK                   0xFFFFFFFF
#define _USBDMA2A_DMAADDR_LENGTH                 0x00000020

#define _USBDMA2N_DMACOUNT_POSITION              0x00000000
#define _USBDMA2N_DMACOUNT_MASK                  0xFFFFFFFF
#define _USBDMA2N_DMACOUNT_LENGTH                0x00000020

#define _USBDMA3C_DMAEN_POSITION                 0x00000000
#define _USBDMA3C_DMAEN_MASK                     0x00000001
#define _USBDMA3C_DMAEN_LENGTH                   0x00000001

#define _USBDMA3C_DMADIR_POSITION                0x00000001
#define _USBDMA3C_DMADIR_MASK                    0x00000002
#define _USBDMA3C_DMADIR_LENGTH                  0x00000001

#define _USBDMA3C_DMAMODE_POSITION               0x00000002
#define _USBDMA3C_DMAMODE_MASK                   0x00000004
#define _USBDMA3C_DMAMODE_LENGTH                 0x00000001

#define _USBDMA3C_DMAIE_POSITION                 0x00000003
#define _USBDMA3C_DMAIE_MASK                     0x00000008
#define _USBDMA3C_DMAIE_LENGTH                   0x00000001

#define _USBDMA3C_DMAEP_POSITION                 0x00000004
#define _USBDMA3C_DMAEP_MASK                     0x000000F0
#define _USBDMA3C_DMAEP_LENGTH                   0x00000004

#define _USBDMA3C_DMAERR_POSITION                0x00000008
#define _USBDMA3C_DMAERR_MASK                    0x00000100
#define _USBDMA3C_DMAERR_LENGTH                  0x00000001

#define _USBDMA3C_DMABRSTM_POSITION              0x00000009
#define _USBDMA3C_DMABRSTM_MASK                  0x00000600
#define _USBDMA3C_DMABRSTM_LENGTH                0x00000002

#define _USBDMA3A_DMAADDR_POSITION               0x00000000
#define _USBDMA3A_DMAADDR_MASK                   0xFFFFFFFF
#define _USBDMA3A_DMAADDR_LENGTH                 0x00000020

#define _USBDMA3N_DMACOUNT_POSITION              0x00000000
#define _USBDMA3N_DMACOUNT_MASK                  0xFFFFFFFF
#define _USBDMA3N_DMACOUNT_LENGTH                0x00000020

#define _USBDMA4C_DMAEN_POSITION                 0x00000000
#define _USBDMA4C_DMAEN_MASK                     0x00000001
#define _USBDMA4C_DMAEN_LENGTH                   0x00000001

#define _USBDMA4C_DMADIR_POSITION                0x00000001
#define _USBDMA4C_DMADIR_MASK                    0x00000002
#define _USBDMA4C_DMADIR_LENGTH                  0x00000001

#define _USBDMA4C_DMAMODE_POSITION               0x00000002
#define _USBDMA4C_DMAMODE_MASK                   0x00000004
#define _USBDMA4C_DMAMODE_LENGTH                 0x00000001

#define _USBDMA4C_DMAIE_POSITION                 0x00000003
#define _USBDMA4C_DMAIE_MASK                     0x00000008
#define _USBDMA4C_DMAIE_LENGTH                   0x00000001

#define _USBDMA4C_DMAEP_POSITION                 0x00000004
#define _USBDMA4C_DMAEP_MASK                     0x000000F0
#define _USBDMA4C_DMAEP_LENGTH                   0x00000004

#define _USBDMA4C_DMAERR_POSITION                0x00000008
#define _USBDMA4C_DMAERR_MASK                    0x00000100
#define _USBDMA4C_DMAERR_LENGTH                  0x00000001

#define _USBDMA4C_DMABRSTM_POSITION              0x00000009
#define _USBDMA4C_DMABRSTM_MASK                  0x00000600
#define _USBDMA4C_DMABRSTM_LENGTH                0x00000002

#define _USBDMA4A_DMAADDR_POSITION               0x00000000
#define _USBDMA4A_DMAADDR_MASK                   0xFFFFFFFF
#define _USBDMA4A_DMAADDR_LENGTH                 0x00000020

#define _USBDMA4N_DMACOUNT_POSITION              0x00000000
#define _USBDMA4N_DMACOUNT_MASK                  0xFFFFFFFF
#define _USBDMA4N_DMACOUNT_LENGTH                0x00000020

#define _USBDMA5C_DMAEN_POSITION                 0x00000000
#define _USBDMA5C_DMAEN_MASK                     0x00000001
#define _USBDMA5C_DMAEN_LENGTH                   0x00000001

#define _USBDMA5C_DMADIR_POSITION                0x00000001
#define _USBDMA5C_DMADIR_MASK                    0x00000002
#define _USBDMA5C_DMADIR_LENGTH                  0x00000001

#define _USBDMA5C_DMAMODE_POSITION               0x00000002
#define _USBDMA5C_DMAMODE_MASK                   0x00000004
#define _USBDMA5C_DMAMODE_LENGTH                 0x00000001

#define _USBDMA5C_DMAIE_POSITION                 0x00000003
#define _USBDMA5C_DMAIE_MASK                     0x00000008
#define _USBDMA5C_DMAIE_LENGTH                   0x00000001

#define _USBDMA5C_DMAEP_POSITION                 0x00000004
#define _USBDMA5C_DMAEP_MASK                     0x000000F0
#define _USBDMA5C_DMAEP_LENGTH                   0x00000004

